import React from "react";
import Summerize from "../_component/Summerize";

const page = () => {
  const body =
    "当社グループは株式会社極洋(当社)及び子会社26社、関連会社４社により構成され、水産商事事業、食品事業、鰹・鮪事業、物流サービス事業を主として行っております。各事業における当社グループの位置付けは次のとおりであります。下記の事業区分は、セグメント情報の区分と同一であります。水産商事事業…当社及びKyokuyoAmericaCorporation他において水産物の買付及び加工、販売を行っております。食品事業…当社、極洋食品㈱及び㈱ジョッキ他において業務用冷凍食品、市販用冷凍食品・缶詰・海産物珍味の製造及び販売を行っております。鰹・鮪事業…当社及び極洋水産㈱他においてカツオ・マグロ等の漁獲、養殖、買付及び加工、販売を行っております。物流サービス事業…キョクヨー秋津冷蔵㈱において冷蔵倉庫事業を行っております。その他事業…キョクヨー総合サービス㈱他において保険代理店業等を行っております。";

  const handleClick = async () => {};

  return (
    <div className="h-full w-full flex-col justify-center items-center p-10">
      <div className="w-full">
        <p className="py-10 font-bold">
          OPEN AIのAPIを使って以下の文章を要約します。
        </p>
        <p className="bg-origin-border ">
          当社グループは株式会社極洋(当社)及び子会社26社、関連会社４社により構成され、水産商事事業、食品事業、鰹・鮪事業、物流サービス事業を主として行っております。各事業における当社グループの位置付けは次のとおりであります。
          下記の事業区分は、セグメント情報の区分と同一であります。水産商事事業…当社及びKyokuyo
          America
          Corporation他において水産物の買付及び加工、販売を行っております。食品事業…当社、極洋食品㈱及び㈱ジョッキ他において業務用冷凍食品、市販用冷凍食品・缶詰・海産物珍味の製造及び販売を行っております。鰹・鮪事業…当社及び極洋水産㈱他においてカツオ・マグロ等の漁獲、養殖、買付及び加工、販売を行っております。物流サービス事業…キョクヨー秋津冷蔵㈱において冷蔵倉庫事業を行っております。その他事業…キョクヨー総合サービス㈱他において保険代理店業等を行っております。
        </p>
      </div>
      <Summerize text={body} />
    </div>
  );
};

export default page;
